Revit 2024 API
ForgeTypeId.StrictlyEquals Method
 Returns true if the entire typeid string held by this ForgeTypeId is exactly equal to that held by the given ForgeTypeId. For the default equality comparison used by the equality operator (==), see NameEquals(ForgeTypeId).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool StrictlyEquals(
	ForgeTypeId other
)
Visual Basic
Public Function StrictlyEquals ( _
	other As ForgeTypeId _
) As Boolean
Visual C++
public:
bool StrictlyEquals(
	ForgeTypeId^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ForgeTypeId
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace